// 2.2. Задан массив [9,8,7,6,5,4,3,2,1]. Создайте две копии данного массива разными способами и поменяйте в них порядок на обратный так же двумя способами. Выведите все три массива.

let arr = [9, 8, 7, 6, 5, 4, 3, 2, 1];

function array_copy(arr) {
    let arr1 = arr.slice().reverse();
    
    let arr2 = [...arr];
    for (let i = 0; i < Math.floor(arr2.length / 2); i++) {
        [arr2[i], arr2[arr2.length - 1 - i]] = [arr2[arr2.length - 1 - i], arr2[i]];
    }

    console.log("Изначальный массив:", arr);
    console.log("Копия 1:", arr1);
    console.log("Копия 2:", arr2);
}

array_copy(arr);
// Изначальный массив: [9, 8, 7, 6, 5, 4, 3, 2, 1]
// Копия 1  [1, 2, 3, 4, 5, 6, 7, 8, 9]
// Копия 2  [1, 2, 3, 4, 5, 6, 7, 8, 9]